#pragma once
#include <iostream>
#include <stdlib.h>
#include "CPlayer.h"
using namespace std;


#define CLS system("cls")
#define mWidth	20
#define mHeight 10
#define PLAYER_SPEED  1.0f

//MAPの配列：グローバル変数
// 0:何もない　 1:壁　 2:Player　 4:Enemy
int mapBuf[10][20] = {
	1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,
	1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
	1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
	1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
	1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
	1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
	1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
	1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
	1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1,
	1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1
};

//マップオブジェクト
typedef enum {
	NONE,
	WALL,
	PLAYER,
	ENEMY
}mapObject;


// マップ表示用バッファ
int mapData[10][20];


